[Killed] BlockStatement
src/actor.ts:22:17
 class RealClock implements Clock {
   #start = Date.now();
 
-  now(): number {
-    return Date.now() - this.#start;
-  }
+  now(): number {}
 
   setTimeout(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
killedBy: RealClock actor without clock uses RealClock — now, setTimeout, clearTimeout
statusReason: expected 'undefined' to be 'number' // Object.is equality

[Survived] ArithmeticOperator
src/actor.ts:23:12
   #start = Date.now();
 
   now(): number {
-    return Date.now() - this.#start;
+    return Date.now() + this.#start;
   }
 

[Survived] BlockStatement
src/actor.ts:26:86
     return Date.now() - this.#start;
   }
 
-  setTimeout(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
-    // @ts-expect-error globalThis.setTimeout returns NodeJS.Timeout | number, but we only use browser env
-    return globalThis.setTimeout(cb, ms, { signal: options?.signal });
-  }
+  setTimeout(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {}
 
   clearTimeout(id: number): void {

[Killed] OptionalChaining
src/actor.ts:28:52
 
   setTimeout(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
     // @ts-expect-error globalThis.setTimeout returns NodeJS.Timeout | number, but we only use browser env
-    return globalThis.setTimeout(cb, ms, { signal: options?.signal });
+    return globalThis.setTimeout(cb, ms, { signal: options.signal });
   }
 
killedBy: RealClock actor without clock uses RealClock — now, setTimeout, clearTimeout
statusReason: Cannot read properties of undefined (reading 'signal')

[Survived] BlockStatement
src/actor.ts:31:34
     return globalThis.setTimeout(cb, ms, { signal: options?.signal });
   }
 
-  clearTimeout(id: number): void {
-    globalThis.clearTimeout(id);
-  }
+  clearTimeout(id: number): void {}
 
   setInterval(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {

[Survived] BlockStatement
src/actor.ts:35:87
     globalThis.clearTimeout(id);
   }
 
-  setInterval(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
-    // @ts-expect-error globalThis.setInterval returns NodeJS.Timeout | number, but we only use browser env
-    return globalThis.setInterval(cb, ms, { signal: options?.signal });
-  }
+  setInterval(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {}
 
   clearInterval(id: number): void {

[Survived] OptionalChaining
src/actor.ts:37:53
 
   setInterval(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
     // @ts-expect-error globalThis.setInterval returns NodeJS.Timeout | number, but we only use browser env
-    return globalThis.setInterval(cb, ms, { signal: options?.signal });
+    return globalThis.setInterval(cb, ms, { signal: options.signal });
   }
 

[Survived] BlockStatement
src/actor.ts:40:35
     return globalThis.setInterval(cb, ms, { signal: options?.signal });
   }
 
-  clearInterval(id: number): void {
-    globalThis.clearInterval(id);
-  }
+  clearInterval(id: number): void {}
 }
 

[Killed] BlockStatement
src/actor.ts:58:17
   #nextId = 1;
   #drain: (() => void) | null = null;
 
-  now(): number {
-    return this.#now;
-  }
+  now(): number {}
 
   setTimeout(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
killedBy: VirtualClock now() starts at 0
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/actor.ts:62:86
     return this.#now;
   }
 
-  setTimeout(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
-    const signal = options?.signal;
-    if (signal?.aborted) return -1;
-    const id = this.#nextId++;
-    const onAbort = signal
-      ? () => {
-          this.#timers.delete(id);
-        }
-      : undefined;
-    if (signal) {
-      signal.addEventListener("abort", onAbort, { once: true });
-    }
-    this.#timers.set(id, { deadline: this.#now + ms, cb, signal, onAbort });
-    return id;
-  }
+  setTimeout(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {}
 
   clearTimeout(id: number): void {
killedBy: timers timer fires after advance
statusReason: expected 'loading' to be 'failed' // Object.is equality

[Killed] OptionalChaining
src/actor.ts:63:20
   }
 
   setTimeout(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
-    const signal = options?.signal;
+    const signal = options.signal;
     if (signal?.aborted) return -1;
     const id = this.#nextId++;
killedBy: timers timer fires after advance
statusReason: expected 'loading' to be 'failed' // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:64:9
 
   setTimeout(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
     const signal = options?.signal;
-    if (signal?.aborted) return -1;
+    if (true) return -1;
     const id = this.#nextId++;
     const onAbort = signal
killedBy: timers timer fires after advance
statusReason: expected 'loading' to be 'failed' // Object.is equality

[Killed] OptionalChaining
src/actor.ts:64:9
 
   setTimeout(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
     const signal = options?.signal;
-    if (signal?.aborted) return -1;
+    if (signal.aborted) return -1;
     const id = this.#nextId++;
     const onAbort = signal
killedBy: VirtualClock timer fires at exact deadline
statusReason: Cannot read properties of undefined (reading 'aborted')

[Killed] UpdateOperator
src/actor.ts:65:16
   setTimeout(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
     const signal = options?.signal;
     if (signal?.aborted) return -1;
-    const id = this.#nextId++;
+    const id = this.#nextId--;
     const onAbort = signal
       ? () => {
killedBy: VirtualClock setInterval interval fires in order with timeouts
statusReason: expected [ 'i100', 't150', 'i100' ] to deeply equal [ 't50', 'i100', 't150', 'i100' ]

[Killed] BlockStatement
src/actor.ts:67:15
     if (signal?.aborted) return -1;
     const id = this.#nextId++;
     const onAbort = signal
-      ? () => {
-          this.#timers.delete(id);
-        }
+      ? () => {}
       : undefined;
     if (signal) {
killedBy: VirtualClock setInterval setTimeout abort signal cancels timer
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:71:9
           this.#timers.delete(id);
         }
       : undefined;
-    if (signal) {
+    if (false) {
       signal.addEventListener("abort", onAbort, { once: true });
     }
killedBy: VirtualClock setInterval setTimeout abort signal cancels timer
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/actor.ts:71:17
           this.#timers.delete(id);
         }
       : undefined;
-    if (signal) {
-      signal.addEventListener("abort", onAbort, { once: true });
-    }
+    if (signal) {}
     this.#timers.set(id, { deadline: this.#now + ms, cb, signal, onAbort });
     return id;
killedBy: VirtualClock setInterval setTimeout abort signal cancels timer
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
src/actor.ts:72:57
         }
       : undefined;
     if (signal) {
-      signal.addEventListener("abort", onAbort, { once: true });
+      signal.addEventListener("abort", onAbort, { once: false });
     }
     this.#timers.set(id, { deadline: this.#now + ms, cb, signal, onAbort });

[Killed] StringLiteral
src/actor.ts:72:31
         }
       : undefined;
     if (signal) {
-      signal.addEventListener("abort", onAbort, { once: true });
+      signal.addEventListener("", onAbort, { once: true });
     }
     this.#timers.set(id, { deadline: this.#now + ms, cb, signal, onAbort });
killedBy: VirtualClock setInterval setTimeout abort signal cancels timer
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/actor.ts:74:38
     if (signal) {
       signal.addEventListener("abort", onAbort, { once: true });
     }
-    this.#timers.set(id, { deadline: this.#now + ms, cb, signal, onAbort });
+    this.#timers.set(id, { deadline: this.#now - ms, cb, signal, onAbort });
     return id;
   }
killedBy: VirtualClock timer fires at exact deadline
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/actor.ts:74:26
     if (signal) {
       signal.addEventListener("abort", onAbort, { once: true });
     }
-    this.#timers.set(id, { deadline: this.#now + ms, cb, signal, onAbort });
+    this.#timers.set(id, {});
     return id;
   }
killedBy: VirtualClock timer fires at exact deadline
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/actor.ts:78:34
     return id;
   }
 
-  clearTimeout(id: number): void {
-    const timer = this.#timers.get(id);
-    if (timer) {
-      if (timer.signal && timer.onAbort) {
-        timer.signal.removeEventListener("abort", timer.onAbort);
-      }
-      this.#timers.delete(id);
-    }
-  }
+  clearTimeout(id: number): void {}
 
   setInterval(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
killedBy: VirtualClock clearTimeout prevents firing
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:80:9
 
   clearTimeout(id: number): void {
     const timer = this.#timers.get(id);
-    if (timer) {
+    if (true) {
       if (timer.signal && timer.onAbort) {
         timer.signal.removeEventListener("abort", timer.onAbort);
killedBy: VirtualClock clearTimeout on non-existent id is no-op
statusReason: Cannot read properties of undefined (reading 'signal')

[Killed] ConditionalExpression
src/actor.ts:80:9
 
   clearTimeout(id: number): void {
     const timer = this.#timers.get(id);
-    if (timer) {
+    if (false) {
       if (timer.signal && timer.onAbort) {
         timer.signal.removeEventListener("abort", timer.onAbort);
killedBy: timers state-scoped timer uses signal abort on exit
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:81:11
   clearTimeout(id: number): void {
     const timer = this.#timers.get(id);
     if (timer) {
-      if (timer.signal && timer.onAbort) {
+      if (true) {
         timer.signal.removeEventListener("abort", timer.onAbort);
       }
killedBy: VirtualClock clearTimeout prevents firing
statusReason: Cannot read properties of undefined (reading 'removeEventListener')

[Survived] ConditionalExpression
src/actor.ts:81:11
   clearTimeout(id: number): void {
     const timer = this.#timers.get(id);
     if (timer) {
-      if (timer.signal && timer.onAbort) {
+      if (false) {
         timer.signal.removeEventListener("abort", timer.onAbort);
       }

[Killed] BlockStatement
src/actor.ts:88:87
     }
   }
 
-  setInterval(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
-    const signal = options?.signal;
-    if (signal?.aborted) return -1;
-    const id = this.#nextId++;
-    const onAbort = signal
-      ? () => {
-          this.#intervals.delete(id);
-        }
-      : undefined;
-    if (signal && onAbort) {
-      signal.addEventListener("abort", onAbort, { once: true });
-    }
-    this.#intervals.set(id, { ms, next: this.#now + ms, cb, signal, onAbort });
-    return id;
-  }
+  setInterval(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {}
 
   clearInterval(id: number): void {
killedBy: VirtualClock setInterval fires repeatedly at interval
statusReason: expected [] to deeply equal [ 100, 200, 300 ]

[Killed] OptionalChaining
src/actor.ts:89:20
   }
 
   setInterval(ms: number, cb: () => void, options?: { signal?: AbortSignal }): number {
-    const signal = options?.signal;
+    const signal = options.signal;
     if (signal?.aborted) return -1;
     const id = this.#nextId++;
killedBy: VirtualClock setInterval fires repeatedly at interval
statusReason: Cannot read properties of undefined (reading 'signal')

[Killed] BlockStatement
src/actor.ts:93:15
     if (signal?.aborted) return -1;
     const id = this.#nextId++;
     const onAbort = signal
-      ? () => {
-          this.#intervals.delete(id);
-        }
+      ? () => {}
       : undefined;
     if (signal && onAbort) {
killedBy: VirtualClock setInterval setInterval abort signal cancels interval
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:97:9
           this.#intervals.delete(id);
         }
       : undefined;
-    if (signal && onAbort) {
+    if (false) {
       signal.addEventListener("abort", onAbort, { once: true });
     }
killedBy: VirtualClock setInterval setInterval abort signal cancels interval
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
src/actor.ts:97:28
           this.#intervals.delete(id);
         }
       : undefined;
-    if (signal && onAbort) {
-      signal.addEventListener("abort", onAbort, { once: true });
-    }
+    if (signal && onAbort) {}
     this.#intervals.set(id, { ms, next: this.#now + ms, cb, signal, onAbort });
     return id;
killedBy: VirtualClock setInterval setInterval abort signal cancels interval
statusReason: expected 4 to be 2 // Object.is equality

[Survived] BooleanLiteral
src/actor.ts:98:57
         }
       : undefined;
     if (signal && onAbort) {
-      signal.addEventListener("abort", onAbort, { once: true });
+      signal.addEventListener("abort", onAbort, { once: false });
     }
     this.#intervals.set(id, { ms, next: this.#now + ms, cb, signal, onAbort });

[Survived] ObjectLiteral
src/actor.ts:98:49
         }
       : undefined;
     if (signal && onAbort) {
-      signal.addEventListener("abort", onAbort, { once: true });
+      signal.addEventListener("abort", onAbort, {});
     }
     this.#intervals.set(id, { ms, next: this.#now + ms, cb, signal, onAbort });

[Killed] ArithmeticOperator
src/actor.ts:100:41
     if (signal && onAbort) {
       signal.addEventListener("abort", onAbort, { once: true });
     }
-    this.#intervals.set(id, { ms, next: this.#now + ms, cb, signal, onAbort });
+    this.#intervals.set(id, { ms, next: this.#now - ms, cb, signal, onAbort });
     return id;
   }
killedBy: VirtualClock setInterval fires repeatedly at interval
statusReason: expected [ -100, +0, 100, 200, 300 ] to deeply equal [ 100, 200, 300 ]

[Killed] BlockStatement
src/actor.ts:104:35
     return id;
   }
 
-  clearInterval(id: number): void {
-    const interval = this.#intervals.get(id);
-    if (interval) {
-      if (interval.signal && interval.onAbort) {
-        interval.signal.removeEventListener("abort", interval.onAbort);
-      }
-      this.#intervals.delete(id);
-    }
-  }
+  clearInterval(id: number): void {}
 
   advance(ms: number): void {
killedBy: VirtualClock setInterval clearInterval stops firing
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
src/actor.ts:106:19
 
   clearInterval(id: number): void {
     const interval = this.#intervals.get(id);
-    if (interval) {
-      if (interval.signal && interval.onAbort) {
-        interval.signal.removeEventListener("abort", interval.onAbort);
-      }
-      this.#intervals.delete(id);
-    }
+    if (interval) {}
   }
 
killedBy: VirtualClock setInterval clearInterval stops firing
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:106:9
 
   clearInterval(id: number): void {
     const interval = this.#intervals.get(id);
-    if (interval) {
+    if (false) {
       if (interval.signal && interval.onAbort) {
         interval.signal.removeEventListener("abort", interval.onAbort);
killedBy: VirtualClock setInterval clearInterval stops firing
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:107:11
   clearInterval(id: number): void {
     const interval = this.#intervals.get(id);
     if (interval) {
-      if (interval.signal && interval.onAbort) {
+      if (true) {
         interval.signal.removeEventListener("abort", interval.onAbort);
       }
killedBy: VirtualClock setInterval clearInterval stops firing
statusReason: Cannot read properties of undefined (reading 'removeEventListener')

[Survived] ConditionalExpression
src/actor.ts:107:11
   clearInterval(id: number): void {
     const interval = this.#intervals.get(id);
     if (interval) {
-      if (interval.signal && interval.onAbort) {
+      if (false) {
         interval.signal.removeEventListener("abort", interval.onAbort);
       }

[Survived] StringLiteral
src/actor.ts:108:45
     const interval = this.#intervals.get(id);
     if (interval) {
       if (interval.signal && interval.onAbort) {
-        interval.signal.removeEventListener("abort", interval.onAbort);
+        interval.signal.removeEventListener("", interval.onAbort);
       }
       this.#intervals.delete(id);

[Killed] ArithmeticOperator
src/actor.ts:115:20
   }
 
   advance(ms: number): void {
-    const target = this.#now + ms;
+    const target = this.#now - ms;
 
     const events: Array<{ time: number; type: "timer" | "interval"; id: number }> = [];
killedBy: VirtualClock advance() increments now()
statusReason: expected -100 to be 100 // Object.is equality

[Killed] BlockStatement
src/actor.ts:119:41
 
     const events: Array<{ time: number; type: "timer" | "interval"; id: number }> = [];
 
-    for (const [id, t] of this.#timers) {
-      if (t.deadline <= target) {
-        events.push({ time: t.deadline, type: "timer", id });
-      }
-    }
+    for (const [id, t] of this.#timers) {}
 
     for (const [id, t] of this.#intervals) {
killedBy: VirtualClock timer fires at exact deadline
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/actor.ts:120:33
     const events: Array<{ time: number; type: "timer" | "interval"; id: number }> = [];
 
     for (const [id, t] of this.#timers) {
-      if (t.deadline <= target) {
-        events.push({ time: t.deadline, type: "timer", id });
-      }
+      if (t.deadline <= target) {}
     }
 
killedBy: VirtualClock timer fires at exact deadline
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/actor.ts:120:11
     const events: Array<{ time: number; type: "timer" | "interval"; id: number }> = [];
 
     for (const [id, t] of this.#timers) {
-      if (t.deadline <= target) {
+      if (t.deadline > target) {
         events.push({ time: t.deadline, type: "timer", id });
       }
killedBy: VirtualClock timer fires at exact deadline
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/actor.ts:125:44
       }
     }
 
-    for (const [id, t] of this.#intervals) {
-      let fire = t.next;
-      const step = t.ms || 1;
-      while (fire <= target) {
-        events.push({ time: fire, type: "interval", id });
-        fire += step;
-      }
-    }
+    for (const [id, t] of this.#intervals) {}
 
     events.sort((a, b) => a.time - b.time);
killedBy: VirtualClock setInterval fires repeatedly at interval
statusReason: expected [] to deeply equal [ 100, 200, 300 ]

[Killed] ConditionalExpression
src/actor.ts:127:20
 
     for (const [id, t] of this.#intervals) {
       let fire = t.next;
-      const step = t.ms || 1;
+      const step = true;
       while (fire <= target) {
         events.push({ time: fire, type: "interval", id });
killedBy: VirtualClock setInterval fires repeatedly at interval
statusReason: expected [ Array(251) ] to deeply equal [ 100, 200, 300 ]

[Killed] LogicalOperator
src/actor.ts:127:20
 
     for (const [id, t] of this.#intervals) {
       let fire = t.next;
-      const step = t.ms || 1;
+      const step = t.ms && 1;
       while (fire <= target) {
         events.push({ time: fire, type: "interval", id });
killedBy: VirtualClock setInterval fires repeatedly at interval
statusReason: expected [ Array(251) ] to deeply equal [ 100, 200, 300 ]

[Killed] ConditionalExpression
src/actor.ts:128:14
     for (const [id, t] of this.#intervals) {
       let fire = t.next;
       const step = t.ms || 1;
-      while (fire <= target) {
+      while (false) {
         events.push({ time: fire, type: "interval", id });
         fire += step;
killedBy: VirtualClock setInterval fires repeatedly at interval
statusReason: expected [] to deeply equal [ 100, 200, 300 ]

[Killed] EqualityOperator
src/actor.ts:128:14
     for (const [id, t] of this.#intervals) {
       let fire = t.next;
       const step = t.ms || 1;
-      while (fire <= target) {
+      while (fire < target) {
         events.push({ time: fire, type: "interval", id });
         fire += step;
killedBy: VirtualClock setInterval interval callback with setTimeout fires on next advance
statusReason: expected +0 to be 1 // Object.is equality

[Timeout] AssignmentOperator
src/actor.ts:130:9
       const step = t.ms || 1;
       while (fire <= target) {
         events.push({ time: fire, type: "interval", id });
-        fire += step;
+        fire -= step;
       }
     }

[Killed] ArithmeticOperator
src/actor.ts:134:27
       }
     }
 
-    events.sort((a, b) => a.time - b.time);
+    events.sort((a, b) => a.time + b.time);
 
     for (const ev of events) {
killedBy: VirtualClock multiple timers fire in order
statusReason: expected [ 300, 100, 200 ] to deeply equal [ 100, 200, 300 ]

[Killed] MethodExpression
src/actor.ts:134:5
       }
     }
 
-    events.sort((a, b) => a.time - b.time);
+    events;
 
     for (const ev of events) {
killedBy: VirtualClock multiple timers fire in order
statusReason: expected [ 300, 100, 200 ] to deeply equal [ 100, 200, 300 ]

[Killed] BlockStatement
src/actor.ts:136:30
 
     events.sort((a, b) => a.time - b.time);
 
-    for (const ev of events) {
-      this.#now = ev.time;
-      if (ev.type === "timer") {
-        const timer = this.#timers.get(ev.id);
-        if (timer) {
-          if (timer.signal && timer.onAbort) {
-            timer.signal.removeEventListener("abort", timer.onAbort);
-          }
-          this.#timers.delete(ev.id);
-          timer.cb();
-        }
-      } else {
-        const interval = this.#intervals.get(ev.id);
-        if (interval) {
-          interval.cb();
-          if (this.#intervals.has(ev.id)) {
-            interval.next = ev.time + interval.ms;
-          }
-        }
-      }
-    }
+    for (const ev of events) {}
 
     this.#now = target;
killedBy: VirtualClock timer fires at exact deadline
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/actor.ts:138:32
 
     for (const ev of events) {
       this.#now = ev.time;
-      if (ev.type === "timer") {
-        const timer = this.#timers.get(ev.id);
-        if (timer) {
-          if (timer.signal && timer.onAbort) {
-            timer.signal.removeEventListener("abort", timer.onAbort);
-          }
-          this.#timers.delete(ev.id);
-          timer.cb();
-        }
-      } else {
+      if (ev.type === "timer") {} else {
         const interval = this.#intervals.get(ev.id);
         if (interval) {
killedBy: VirtualClock timer fires at exact deadline
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:138:11
 
     for (const ev of events) {
       this.#now = ev.time;
-      if (ev.type === "timer") {
+      if (true) {
         const timer = this.#timers.get(ev.id);
         if (timer) {
killedBy: VirtualClock setInterval fires repeatedly at interval
statusReason: expected [] to deeply equal [ 100, 200, 300 ]

[Killed] BlockStatement
src/actor.ts:140:20
       this.#now = ev.time;
       if (ev.type === "timer") {
         const timer = this.#timers.get(ev.id);
-        if (timer) {
-          if (timer.signal && timer.onAbort) {
-            timer.signal.removeEventListener("abort", timer.onAbort);
-          }
-          this.#timers.delete(ev.id);
-          timer.cb();
-        }
+        if (timer) {}
       } else {
         const interval = this.#intervals.get(ev.id);
killedBy: VirtualClock timer fires at exact deadline
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:140:13
       this.#now = ev.time;
       if (ev.type === "timer") {
         const timer = this.#timers.get(ev.id);
-        if (timer) {
+        if (false) {
           if (timer.signal && timer.onAbort) {
             timer.signal.removeEventListener("abort", timer.onAbort);
killedBy: timers timer fires after advance
statusReason: expected 'loading' to be 'failed' // Object.is equality

[Survived] BlockStatement
src/actor.ts:141:46
       if (ev.type === "timer") {
         const timer = this.#timers.get(ev.id);
         if (timer) {
-          if (timer.signal && timer.onAbort) {
-            timer.signal.removeEventListener("abort", timer.onAbort);
-          }
+          if (timer.signal && timer.onAbort) {}
           this.#timers.delete(ev.id);
           timer.cb();

[Killed] BlockStatement
src/actor.ts:147:14
           this.#timers.delete(ev.id);
           timer.cb();
         }
-      } else {
-        const interval = this.#intervals.get(ev.id);
-        if (interval) {
-          interval.cb();
-          if (this.#intervals.has(ev.id)) {
-            interval.next = ev.time + interval.ms;
-          }
-        }
-      }
+      } else {}
     }
 
killedBy: VirtualClock setInterval fires repeatedly at interval
statusReason: expected [] to deeply equal [ 100, 200, 300 ]

[Killed] BlockStatement
src/actor.ts:149:23
         }
       } else {
         const interval = this.#intervals.get(ev.id);
-        if (interval) {
-          interval.cb();
-          if (this.#intervals.has(ev.id)) {
-            interval.next = ev.time + interval.ms;
-          }
-        }
+        if (interval) {}
       }
     }
killedBy: VirtualClock setInterval fires repeatedly at interval
statusReason: expected [] to deeply equal [ 100, 200, 300 ]

[Killed] ConditionalExpression
src/actor.ts:149:13
         }
       } else {
         const interval = this.#intervals.get(ev.id);
-        if (interval) {
+        if (false) {
           interval.cb();
           if (this.#intervals.has(ev.id)) {
killedBy: VirtualClock setInterval fires repeatedly at interval
statusReason: expected [] to deeply equal [ 100, 200, 300 ]

[Killed] ConditionalExpression
src/actor.ts:151:15
         const interval = this.#intervals.get(ev.id);
         if (interval) {
           interval.cb();
-          if (this.#intervals.has(ev.id)) {
+          if (false) {
             interval.next = ev.time + interval.ms;
           }
killedBy: VirtualClock setInterval interval callback with setTimeout fires on next advance
statusReason: expected 4 to be 3 // Object.is equality

[Killed] BlockStatement
src/actor.ts:151:43
         const interval = this.#intervals.get(ev.id);
         if (interval) {
           interval.cb();
-          if (this.#intervals.has(ev.id)) {
-            interval.next = ev.time + interval.ms;
-          }
+          if (this.#intervals.has(ev.id)) {}
         }
       }
killedBy: VirtualClock setInterval interval callback with setTimeout fires on next advance
statusReason: expected 4 to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/actor.ts:152:29
         if (interval) {
           interval.cb();
           if (this.#intervals.has(ev.id)) {
-            interval.next = ev.time + interval.ms;
+            interval.next = ev.time - interval.ms;
           }
         }
killedBy: VirtualClock setInterval interval callback with setTimeout fires on next advance
statusReason: expected 5 to be 3 // Object.is equality

[Killed] OptionalChaining
src/actor.ts:159:5
     }
 
     this.#now = target;
-    this.#drain?.();
+    this.#drain();
   }
 
killedBy: VirtualClock advance() increments now()
statusReason: this[#drain] is not a function

[Killed] BlockStatement
src/actor.ts:162:25
     this.#drain?.();
   }
 
-  hasPending(): boolean {
-    return this.#timers.size > 0 || this.#intervals.size > 0;
-  }
+  hasPending(): boolean {}
 
   /** @internal */
killedBy: VirtualClock multiple timers — partial advance fires only due
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/actor.ts:163:12
   }
 
   hasPending(): boolean {
-    return this.#timers.size > 0 || this.#intervals.size > 0;
+    return this.#timers.size >= 0 || this.#intervals.size > 0;
   }
 
killedBy: timers advance past deadline fires immediately
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:163:12
   }
 
   hasPending(): boolean {
-    return this.#timers.size > 0 || this.#intervals.size > 0;
+    return true;
   }
 
killedBy: timers advance past deadline fires immediately
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/actor.ts:167:35
   }
 
   /** @internal */
-  _setDrain(fn: () => void): void {
-    this.#drain = fn;
-  }
+  _setDrain(fn: () => void): void {}
 }
 
killedBy: timers timer fires after advance
statusReason: expected 'loading' to be 'failed' // Object.is equality

[Killed] BooleanLiteral
src/actor.ts:224:17
   #queueIndex = 0;
   #effectAbort: AbortController | null = null;
   #outputHandler: ((event: { id: string; [key: string]: unknown }) => void) | null = null;
-  #processing = false;
+  #processing = true;
   #subscribers: Set<(snapshot: Snapshot) => void> = new Set();
   #errorSubscribers: Set<(error: unknown) => void> = new Set();
killedBy: timers timer fires after advance
statusReason: expected 'loading' to be 'failed' // Object.is equality
