[Killed] ArrayDeclaration
src/actor.ts:228:42
   #subscribers: Set<(snapshot: Snapshot) => void> = new Set();
   #errorSubscribers: Set<(error: unknown) => void> = new Set();
   #doneSubscribers: Set<() => void> = new Set();
-  #settledResolvers: Array<() => void> = [];
+  #settledResolvers: Array<() => void> = ["Stryker was here"];
 
   get context(): Readonly<ActorContext> {
killedBy: timers timer fires after advance
statusReason: resolve is not a function

[Survived] BlockStatement
src/actor.ts:230:41
   #doneSubscribers: Set<() => void> = new Set();
   #settledResolvers: Array<() => void> = [];
 
-  get context(): Readonly<ActorContext> {
-    return this.#context;
-  }
+  get context(): Readonly<ActorContext> {}
 
   get regions(): ReadonlyMap<string, AnyActor> {

[Survived] BlockStatement
src/actor.ts:234:48
     return this.#context;
   }
 
-  get regions(): ReadonlyMap<string, AnyActor> {
-    return this.#regions;
-  }
+  get regions(): ReadonlyMap<string, AnyActor> {}
 
   /** @internal */ get __children(): Map<string, AnyActor> {

[Survived] BlockStatement
src/actor.ts:238:60
     return this.#regions;
   }
 
-  /** @internal */ get __children(): Map<string, AnyActor> {
-    return this.#children;
-  }
+  /** @internal */ get __children(): Map<string, AnyActor> {}
   /** @internal */ get __outputHandler():
     | ((event: { id: string; [key: string]: unknown }) => void)

[Survived] BlockStatement
src/actor.ts:243:12
   }
   /** @internal */ get __outputHandler():
     | ((event: { id: string; [key: string]: unknown }) => void)
-    | null {
-    return this.#outputHandler;
-  }
+    | null {}
   /** @internal */ set __outputHandler(
     fn: ((event: { id: string; [key: string]: unknown }) => void) | null,

[Survived] BlockStatement
src/actor.ts:248:5
   }
   /** @internal */ set __outputHandler(
     fn: ((event: { id: string; [key: string]: unknown }) => void) | null,
-  ) {
-    this.#outputHandler = fn;
-  }
+  ) {}
   /** @internal */ __pushInternal(event: { id: string; [key: string]: unknown }): void {
     this.#internalQueue.push(event);

[Survived] BlockStatement
src/actor.ts:251:88
   ) {
     this.#outputHandler = fn;
   }
-  /** @internal */ __pushInternal(event: { id: string; [key: string]: unknown }): void {
-    this.#internalQueue.push(event);
-  }
+  /** @internal */ __pushInternal(event: { id: string; [key: string]: unknown }): void {}
   /** @internal */ __drainInternal(): void {
     this.#processInternalQueue();

[Survived] BlockStatement
src/actor.ts:254:44
   /** @internal */ __pushInternal(event: { id: string; [key: string]: unknown }): void {
     this.#internalQueue.push(event);
   }
-  /** @internal */ __drainInternal(): void {
-    this.#processInternalQueue();
-  }
+  /** @internal */ __drainInternal(): void {}
 
   options: {

[Killed] BlockStatement
src/actor.ts:304:6
       >
     >;
     regions?: Record<string, AnyActor>;
-  }) {
-    this.options = options;
-    this.clock = options.clock ?? new RealClock();
-    if (this.clock instanceof VirtualClock) {
-      this.clock._setDrain(() => this.#processInternalQueue());
-    }
-    const init = resolveInitial(options.initial);
-    this.state = init.state;
-    this.#context = options.context;
-    if (options.regions) {
-      for (const [key, child] of Object.entries(options.regions)) {
-        this.#regions.set(key, child);
-        child.__outputHandler = (event) => {
-          this.#internalQueue.push(event);
-          this.#processInternalQueue();
-        };
-      }
-    }
-  }
+  }) {}
 
   on(event: "change", fn: (snapshot: Snapshot) => void): () => void;
killedBy: snapshot flat state — path is [stateName], regions is empty
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] LogicalOperator
src/actor.ts:306:18
     regions?: Record<string, AnyActor>;
   }) {
     this.options = options;
-    this.clock = options.clock ?? new RealClock();
+    this.clock = options.clock && new RealClock();
     if (this.clock instanceof VirtualClock) {
       this.clock._setDrain(() => this.#processInternalQueue());
killedBy: RealClock actor without clock uses RealClock — now, setTimeout, clearTimeout
statusReason: Cannot read properties of undefined (reading 'now')

[Killed] BlockStatement
src/actor.ts:307:45
   }) {
     this.options = options;
     this.clock = options.clock ?? new RealClock();
-    if (this.clock instanceof VirtualClock) {
-      this.clock._setDrain(() => this.#processInternalQueue());
-    }
+    if (this.clock instanceof VirtualClock) {}
     const init = resolveInitial(options.initial);
     this.state = init.state;
killedBy: timers timer fires after advance
statusReason: expected 'loading' to be 'failed' // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:307:9
   }) {
     this.options = options;
     this.clock = options.clock ?? new RealClock();
-    if (this.clock instanceof VirtualClock) {
+    if (false) {
       this.clock._setDrain(() => this.#processInternalQueue());
     }
killedBy: timers timer fires after advance
statusReason: expected 'loading' to be 'failed' // Object.is equality

[Killed] ArrowFunction
src/actor.ts:308:28
     this.options = options;
     this.clock = options.clock ?? new RealClock();
     if (this.clock instanceof VirtualClock) {
-      this.clock._setDrain(() => this.#processInternalQueue());
+      this.clock._setDrain(() => undefined);
     }
     const init = resolveInitial(options.initial);
killedBy: timers timer fires after advance
statusReason: expected 'loading' to be 'failed' // Object.is equality

[Killed] BlockStatement
src/actor.ts:313:26
     const init = resolveInitial(options.initial);
     this.state = init.state;
     this.#context = options.context;
-    if (options.regions) {
-      for (const [key, child] of Object.entries(options.regions)) {
-        this.#regions.set(key, child);
-        child.__outputHandler = (event) => {
-          this.#internalQueue.push(event);
-          this.#processInternalQueue();
-        };
-      }
-    }
+    if (options.regions) {}
   }
 
killedBy: snapshot hierarchical — single region
statusReason: expected { path: [ 'connected' ], regions: {} } to deeply equal { path: [ 'connected' ], …(1) }

[Killed] ConditionalExpression
src/actor.ts:313:9
     const init = resolveInitial(options.initial);
     this.state = init.state;
     this.#context = options.context;
-    if (options.regions) {
+    if (true) {
       for (const [key, child] of Object.entries(options.regions)) {
         this.#regions.set(key, child);
killedBy: timers timer fires after advance
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/actor.ts:314:67
     this.state = init.state;
     this.#context = options.context;
     if (options.regions) {
-      for (const [key, child] of Object.entries(options.regions)) {
-        this.#regions.set(key, child);
-        child.__outputHandler = (event) => {
-          this.#internalQueue.push(event);
-          this.#processInternalQueue();
-        };
-      }
+      for (const [key, child] of Object.entries(options.regions)) {}
     }
   }
killedBy: snapshot hierarchical — single region
statusReason: expected { path: [ 'connected' ], regions: {} } to deeply equal { path: [ 'connected' ], …(1) }

[Survived] BlockStatement
src/actor.ts:316:44
     if (options.regions) {
       for (const [key, child] of Object.entries(options.regions)) {
         this.#regions.set(key, child);
-        child.__outputHandler = (event) => {
-          this.#internalQueue.push(event);
-          this.#processInternalQueue();
-        };
+        child.__outputHandler = (event) => {};
       }
     }

[Killed] BlockStatement
src/actor.ts:330:17
   on(
     event: "change" | "error" | "done",
     fn: ((snapshot: Snapshot) => void) | ((error: unknown) => void) | (() => void),
-  ): () => void {
-    if (event === "change") {
-      const cb = fn as (snapshot: Snapshot) => void;
-      this.#subscribers.add(cb);
-      cb(this.snapshot());
-      return () => {
-        this.#subscribers.delete(cb);
-      };
-    }
-    if (event === "error") {
-      const cb = fn as (error: unknown) => void;
-      this.#errorSubscribers.add(cb);
-      return () => {
-        this.#errorSubscribers.delete(cb);
-      };
-    }
-    if (event === "done") {
-      const cb = fn as () => void;
-      this.#doneSubscribers.add(cb);
-      return () => {
-        this.#doneSubscribers.delete(cb);
-      };
-    }
-    return () => {};
-  }
+  ): () => void {}
 
   subscribe(fn: (snapshot: Snapshot) => void): () => void {
killedBy: subscribe calls callback with current snapshot immediately
statusReason: expected undefined to deeply equal { path: [ 'off' ], regions: {} }

[Killed] EqualityOperator
src/actor.ts:331:9
     event: "change" | "error" | "done",
     fn: ((snapshot: Snapshot) => void) | ((error: unknown) => void) | (() => void),
   ): () => void {
-    if (event === "change") {
+    if (event !== "change") {
       const cb = fn as (snapshot: Snapshot) => void;
       this.#subscribers.add(cb);
killedBy: subscribe calls callback with current snapshot immediately
statusReason: expected undefined to deeply equal { path: [ 'off' ], regions: {} }

[Killed] BlockStatement
src/actor.ts:331:29
     event: "change" | "error" | "done",
     fn: ((snapshot: Snapshot) => void) | ((error: unknown) => void) | (() => void),
   ): () => void {
-    if (event === "change") {
-      const cb = fn as (snapshot: Snapshot) => void;
-      this.#subscribers.add(cb);
-      cb(this.snapshot());
-      return () => {
-        this.#subscribers.delete(cb);
-      };
-    }
+    if (event === "change") {}
     if (event === "error") {
       const cb = fn as (error: unknown) => void;
killedBy: subscribe calls callback with current snapshot immediately
statusReason: expected undefined to deeply equal { path: [ 'off' ], regions: {} }

[Killed] BlockStatement
src/actor.ts:335:20
       const cb = fn as (snapshot: Snapshot) => void;
       this.#subscribers.add(cb);
       cb(this.snapshot());
-      return () => {
-        this.#subscribers.delete(cb);
-      };
+      return () => {};
     }
     if (event === "error") {
killedBy: subscribe unsubscribe stops notifications
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:339:9
         this.#subscribers.delete(cb);
       };
     }
-    if (event === "error") {
+    if (true) {
       const cb = fn as (error: unknown) => void;
       this.#errorSubscribers.add(cb);
killedBy: on done subscription fires when reaching final state
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:339:9
         this.#subscribers.delete(cb);
       };
     }
-    if (event === "error") {
+    if (false) {
       const cb = fn as (error: unknown) => void;
       this.#errorSubscribers.add(cb);
killedBy: on error subscription receives errors thrown in effects
statusReason: expected [] to have a length of 1 but got +0

[Survived] BlockStatement
src/actor.ts:342:20
     if (event === "error") {
       const cb = fn as (error: unknown) => void;
       this.#errorSubscribers.add(cb);
-      return () => {
-        this.#errorSubscribers.delete(cb);
-      };
+      return () => {};
     }
     if (event === "done") {

[Killed] ConditionalExpression
src/actor.ts:346:9
         this.#errorSubscribers.delete(cb);
       };
     }
-    if (event === "done") {
+    if (false) {
       const cb = fn as () => void;
       this.#doneSubscribers.add(cb);
killedBy: on done subscription fires when reaching final state
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/actor.ts:346:9
         this.#errorSubscribers.delete(cb);
       };
     }
-    if (event === "done") {
+    if (event !== "done") {
       const cb = fn as () => void;
       this.#doneSubscribers.add(cb);
killedBy: on done subscription fires when reaching final state
statusReason: expected +0 to be 1 // Object.is equality

[Survived] BlockStatement
src/actor.ts:349:20
     if (event === "done") {
       const cb = fn as () => void;
       this.#doneSubscribers.add(cb);
-      return () => {
-        this.#doneSubscribers.delete(cb);
-      };
+      return () => {};
     }
     return () => {};

[Killed] BlockStatement
src/actor.ts:356:59
     return () => {};
   }
 
-  subscribe(fn: (snapshot: Snapshot) => void): () => void {
-    return this.on("change", fn);
-  }
+  subscribe(fn: (snapshot: Snapshot) => void): () => void {}
 
   settled(): Promise<void> {
killedBy: subscribe calls callback with current snapshot immediately
statusReason: expected undefined to deeply equal { path: [ 'off' ], regions: {} }

[Killed] StringLiteral
src/actor.ts:357:20
   }
 
   subscribe(fn: (snapshot: Snapshot) => void): () => void {
-    return this.on("change", fn);
+    return this.on("", fn);
   }
 
killedBy: subscribe calls callback with current snapshot immediately
statusReason: expected undefined to deeply equal { path: [ 'off' ], regions: {} }

[Killed] BlockStatement
src/actor.ts:360:28
     return this.on("change", fn);
   }
 
-  settled(): Promise<void> {
-    if (this.#internalQueue.length === 0 && !this.#processing) {
-      return Promise.resolve();
-    }
-    return new Promise((resolve) => {
-      this.#settledResolvers.push(resolve);
-    });
-  }
+  settled(): Promise<void> {}
 
   send(event: Inputs[number] | { id: string; [key: string]: unknown }): void {
killedBy: settled during processing settled called mid-processing via transition — resolves after drain
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
src/actor.ts:361:9
   }
 
   settled(): Promise<void> {
-    if (this.#internalQueue.length === 0 && !this.#processing) {
+    if (false) {
       return Promise.resolve();
     }
killedBy: settled resolves immediately when queue empty
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/actor.ts:361:45
   }
 
   settled(): Promise<void> {
-    if (this.#internalQueue.length === 0 && !this.#processing) {
+    if (this.#internalQueue.length === 0 && this.#processing) {
       return Promise.resolve();
     }
killedBy: settled resolves immediately when queue empty
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BlockStatement
src/actor.ts:364:37
     if (this.#internalQueue.length === 0 && !this.#processing) {
       return Promise.resolve();
     }
-    return new Promise((resolve) => {
-      this.#settledResolvers.push(resolve);
-    });
+    return new Promise((resolve) => {});
   }
 

[Killed] ConditionalExpression
src/actor.ts:375:9
       | TransitionHandler<ActorContext>
       | undefined;
 
-    if (anyTransition) {
+    if (true) {
       const step = anyTransition(event, { context: this.#context, actor: this as AnyActor });
       if (step.state) {
killedBy: snapshot flat state — after transition
statusReason: anyTransition is not a function

[Survived] ConditionalExpression
src/actor.ts:375:9
       | TransitionHandler<ActorContext>
       | undefined;
 
-    if (anyTransition) {
+    if (false) {
       const step = anyTransition(event, { context: this.#context, actor: this as AnyActor });
       if (step.state) {

[Survived] ObjectLiteral
src/actor.ts:376:41
       | undefined;
 
     if (anyTransition) {
-      const step = anyTransition(event, { context: this.#context, actor: this as AnyActor });
+      const step = anyTransition(event, {});
       if (step.state) {
         this.#applyTransition(event, step);

[Survived] ConditionalExpression
src/actor.ts:377:11
 
     if (anyTransition) {
       const step = anyTransition(event, { context: this.#context, actor: this as AnyActor });
-      if (step.state) {
+      if (true) {
         this.#applyTransition(event, step);
         return;

[Survived] BlockStatement
src/actor.ts:377:23
 
     if (anyTransition) {
       const step = anyTransition(event, { context: this.#context, actor: this as AnyActor });
-      if (step.state) {
-        this.#applyTransition(event, step);
-        return;
-      }
+      if (step.state) {}
       if (step.emit) {
         this.#internalQueue.push(...(step.emit as Array<{ id: string; [key: string]: unknown }>));

[Survived] ConditionalExpression
src/actor.ts:381:11
         this.#applyTransition(event, step);
         return;
       }
-      if (step.emit) {
+      if (false) {
         this.#internalQueue.push(...(step.emit as Array<{ id: string; [key: string]: unknown }>));
       }

[Survived] ConditionalExpression
src/actor.ts:381:11
         this.#applyTransition(event, step);
         return;
       }
-      if (step.emit) {
+      if (true) {
         this.#internalQueue.push(...(step.emit as Array<{ id: string; [key: string]: unknown }>));
       }

[Killed] ConditionalExpression
src/actor.ts:391:9
       event.id as string
     ] as TransitionHandler<ActorContext> | undefined;
 
-    if (stateTransition) {
+    if (false) {
       const step = stateTransition(event, { context: this.#context, actor: this as AnyActor });
       this.#applyTransition(event, step);
killedBy: snapshot flat state — after transition
statusReason: expected { path: [ 'off' ], regions: {} } to deeply equal { path: [ 'on' ], regions: {} }

[Killed] ConditionalExpression
src/actor.ts:391:9
       event.id as string
     ] as TransitionHandler<ActorContext> | undefined;
 
-    if (stateTransition) {
+    if (true) {
       const step = stateTransition(event, { context: this.#context, actor: this as AnyActor });
       this.#applyTransition(event, step);
killedBy: on error subscription unsubscribe stops error notifications
statusReason: stateTransition is not a function

[Survived] ConditionalExpression
src/actor.ts:396:9
       this.#applyTransition(event, step);
     }
 
-    if (anyTransition && !stateTransition) {
+    if (true) {
       this.#processInternalQueue();
     }

[Survived] BlockStatement
src/actor.ts:396:44
       this.#applyTransition(event, step);
     }
 
-    if (anyTransition && !stateTransition) {
-      this.#processInternalQueue();
-    }
+    if (anyTransition && !stateTransition) {}
   }
 

[Killed] ConditionalExpression
src/actor.ts:405:9
     event: Inputs[number] | { id: string; [key: string]: unknown },
     step: TransitionResult,
   ): void {
-    if (step.state) {
+    if (false) {
       this.#effectAbort?.abort();
       let payload: unknown;
killedBy: snapshot flat state — after transition
statusReason: expected { path: [ 'off' ], regions: {} } to deeply equal { path: [ 'on' ], regions: {} }

[Killed] ConditionalExpression
src/actor.ts:405:9
     event: Inputs[number] | { id: string; [key: string]: unknown },
     step: TransitionResult,
   ): void {
-    if (step.state) {
+    if (true) {
       this.#effectAbort?.abort();
       let payload: unknown;
killedBy: settled during processing settled called mid-processing via transition — resolves after drain
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] OptionalChaining
src/actor.ts:406:7
     step: TransitionResult,
   ): void {
     if (step.state) {
-      this.#effectAbort?.abort();
+      this.#effectAbort.abort();
       let payload: unknown;
       if (step.state instanceof TransitionStateClass) {
killedBy: timers timer fires after advance
statusReason: Cannot read properties of null (reading 'abort')

[Killed] BlockStatement
src/actor.ts:408:55
     if (step.state) {
       this.#effectAbort?.abort();
       let payload: unknown;
-      if (step.state instanceof TransitionStateClass) {
-        payload = step.state.__payload;
-        this.state = step.state.__stateRef as States[number];
-      } else {
+      if (step.state instanceof TransitionStateClass) {} else {
         this.state = step.state as States[number];
       }
killedBy: snapshot flat state — after transition
statusReason: expected { path: [ 'off' ], regions: {} } to deeply equal { path: [ 'on' ], regions: {} }

[Killed] ConditionalExpression
src/actor.ts:408:11
     if (step.state) {
       this.#effectAbort?.abort();
       let payload: unknown;
-      if (step.state instanceof TransitionStateClass) {
+      if (true) {
         payload = step.state.__payload;
         this.state = step.state.__stateRef as States[number];
killedBy: effects effect runs on state transition
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/actor.ts:411:14
       if (step.state instanceof TransitionStateClass) {
         payload = step.state.__payload;
         this.state = step.state.__stateRef as States[number];
-      } else {
-        this.state = step.state as States[number];
-      }
+      } else {}
       this.#runEffects(event, payload);
       for (const fn of this.#subscribers) {
killedBy: effects effect runs on state transition
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/actor.ts:415:43
         this.state = step.state as States[number];
       }
       this.#runEffects(event, payload);
-      for (const fn of this.#subscribers) {
-        fn(this.snapshot());
-      }
+      for (const fn of this.#subscribers) {}
       if (this.state.isFinal) {
         for (const fn of this.#doneSubscribers) {
killedBy: subscribe calls callback on state change
statusReason: expected [ { path: [ 'off' ], regions: {} } ] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/actor.ts:418:31
       for (const fn of this.#subscribers) {
         fn(this.snapshot());
       }
-      if (this.state.isFinal) {
-        for (const fn of this.#doneSubscribers) {
-          fn();
-        }
-      }
+      if (this.state.isFinal) {}
     }
 
killedBy: on done subscription fires when reaching final state
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:418:11
       for (const fn of this.#subscribers) {
         fn(this.snapshot());
       }
-      if (this.state.isFinal) {
+      if (false) {
         for (const fn of this.#doneSubscribers) {
           fn();
killedBy: on done subscription fires when reaching final state
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/actor.ts:419:49
         fn(this.snapshot());
       }
       if (this.state.isFinal) {
-        for (const fn of this.#doneSubscribers) {
-          fn();
-        }
+        for (const fn of this.#doneSubscribers) {}
       }
     }
killedBy: on done subscription fires when reaching final state
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:425:9
       }
     }
 
-    if (step.emit) {
+    if (false) {
       this.#internalQueue.push(...(step.emit as Array<{ id: string; [key: string]: unknown }>));
       this.#processInternalQueue();
killedBy: effects emit in transition result processes internal events
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:425:9
       }
     }
 
-    if (step.emit) {
+    if (true) {
       this.#internalQueue.push(...(step.emit as Array<{ id: string; [key: string]: unknown }>));
       this.#processInternalQueue();
killedBy: timers timer fires after advance
statusReason: step.emit is not iterable (cannot read property undefined)

[Survived] OptionalChaining
src/actor.ts:436:21
     statePayload: unknown,
   ): void {
     // @ts-expect-error state.name is a StateNames but TS can't narrow
-    const effects = this.options.effects?.[this.state.name];
+    const effects = this.options.effects[this.state.name];
     if (!effects) return;
 

[Killed] ConditionalExpression
src/actor.ts:437:9
   ): void {
     // @ts-expect-error state.name is a StateNames but TS can't narrow
     const effects = this.options.effects?.[this.state.name];
-    if (!effects) return;
+    if (true) return;
 
     const abort = new AbortController();
killedBy: effects effect runs on state transition
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:437:9
   ): void {
     // @ts-expect-error state.name is a StateNames but TS can't narrow
     const effects = this.options.effects?.[this.state.name];
-    if (!effects) return;
+    if (false) return;
 
     const abort = new AbortController();
killedBy: snapshot flat state — after transition
statusReason: effects is not iterable

[Killed] BlockStatement
src/actor.ts:441:37
 
     const abort = new AbortController();
     this.#effectAbort = abort;
-    for (const effectFn of effects) {
-      try {
-        effectFn({
-          signal: abort.signal,
-          state: { name: this.state.name as string, payload: statePayload },
-          event,
-          context: this.#context,
-          emit: (e: { id: string; [key: string]: unknown }) => this.#internalQueue.push(e),
-          clock: this.clock,
-        });
-      } catch (err) {
-        for (const fn of this.#errorSubscribers) {
-          fn(err);
-        }
-      }
-    }
+    for (const effectFn of effects) {}
 
     this.#processInternalQueue();
killedBy: effects effect runs on state transition
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/actor.ts:442:11
     const abort = new AbortController();
     this.#effectAbort = abort;
     for (const effectFn of effects) {
-      try {
-        effectFn({
-          signal: abort.signal,
-          state: { name: this.state.name as string, payload: statePayload },
-          event,
-          context: this.#context,
-          emit: (e: { id: string; [key: string]: unknown }) => this.#internalQueue.push(e),
-          clock: this.clock,
-        });
-      } catch (err) {
+      try {} catch (err) {
         for (const fn of this.#errorSubscribers) {
           fn(err);
killedBy: effects effect runs on state transition
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/actor.ts:443:18
     this.#effectAbort = abort;
     for (const effectFn of effects) {
       try {
-        effectFn({
-          signal: abort.signal,
-          state: { name: this.state.name as string, payload: statePayload },
-          event,
-          context: this.#context,
-          emit: (e: { id: string; [key: string]: unknown }) => this.#internalQueue.push(e),
-          clock: this.clock,
-        });
+        effectFn({});
       } catch (err) {
         for (const fn of this.#errorSubscribers) {
killedBy: effects effect can emit internal events
statusReason: expected 'loading' to be 'success' // Object.is equality

[Killed] ArrowFunction
src/actor.ts:448:17
           state: { name: this.state.name as string, payload: statePayload },
           event,
           context: this.#context,
-          emit: (e: { id: string; [key: string]: unknown }) => this.#internalQueue.push(e),
+          emit: () => undefined,
           clock: this.clock,
         });
killedBy: effects effect can emit internal events
statusReason: expected 'loading' to be 'success' // Object.is equality

[Killed] BlockStatement
src/actor.ts:451:21
           emit: (e: { id: string; [key: string]: unknown }) => this.#internalQueue.push(e),
           clock: this.clock,
         });
-      } catch (err) {
-        for (const fn of this.#errorSubscribers) {
-          fn(err);
-        }
-      }
+      } catch (err) {}
     }
 
killedBy: on error subscription receives errors thrown in effects
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/actor.ts:452:50
           clock: this.clock,
         });
       } catch (err) {
-        for (const fn of this.#errorSubscribers) {
-          fn(err);
-        }
+        for (const fn of this.#errorSubscribers) {}
       }
     }
killedBy: on error subscription receives errors thrown in effects
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/actor.ts:461:33
     this.#processInternalQueue();
   }
 
-  #processInternalQueue(): void {
-    if (this.#processing) return;
-    this.#processing = true;
-    while (this.#queueIndex < this.#internalQueue.length) {
-      const event = this.#internalQueue[this.#queueIndex++];
-      if (this.options.internal.some((e) => e.id === event.id)) {
-        this.send(event);
-      } else if (this.#outputHandler) {
-        this.#outputHandler(event);
-      }
-    }
-    this.#internalQueue.length = 0;
-    this.#queueIndex = 0;
-    this.#processing = false;
-    if (this.#internalQueue.length === 0 && this.#settledResolvers.length > 0) {
-      const resolvers = this.#settledResolvers.splice(0);
-      for (const resolve of resolvers) {
-        resolve();
-      }
-    }
-  }
+  #processInternalQueue(): void {}
 
   snapshot(): Snapshot {
killedBy: effects effect can emit internal events
statusReason: expected 'loading' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:462:9
   }
 
   #processInternalQueue(): void {
-    if (this.#processing) return;
+    if (true) return;
     this.#processing = true;
     while (this.#queueIndex < this.#internalQueue.length) {
killedBy: effects effect can emit internal events
statusReason: expected 'loading' to be 'success' // Object.is equality

[Survived] ConditionalExpression
src/actor.ts:462:9
   }
 
   #processInternalQueue(): void {
-    if (this.#processing) return;
+    if (false) return;
     this.#processing = true;
     while (this.#queueIndex < this.#internalQueue.length) {
