[Survived] BooleanLiteral
src/actor.ts:463:24
 
   #processInternalQueue(): void {
     if (this.#processing) return;
-    this.#processing = true;
+    this.#processing = false;
     while (this.#queueIndex < this.#internalQueue.length) {
       const event = this.#internalQueue[this.#queueIndex++];

[Killed] EqualityOperator
src/actor.ts:464:12
   #processInternalQueue(): void {
     if (this.#processing) return;
     this.#processing = true;
-    while (this.#queueIndex < this.#internalQueue.length) {
+    while (this.#queueIndex <= this.#internalQueue.length) {
       const event = this.#internalQueue[this.#queueIndex++];
       if (this.options.internal.some((e) => e.id === event.id)) {
killedBy: effects effect can emit internal events
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/actor.ts:464:12
   #processInternalQueue(): void {
     if (this.#processing) return;
     this.#processing = true;
-    while (this.#queueIndex < this.#internalQueue.length) {
+    while (false) {
       const event = this.#internalQueue[this.#queueIndex++];
       if (this.options.internal.some((e) => e.id === event.id)) {
killedBy: effects effect can emit internal events
statusReason: expected 'loading' to be 'success' // Object.is equality

[Killed] UpdateOperator
src/actor.ts:465:41
     if (this.#processing) return;
     this.#processing = true;
     while (this.#queueIndex < this.#internalQueue.length) {
-      const event = this.#internalQueue[this.#queueIndex++];
+      const event = this.#internalQueue[this.#queueIndex--];
       if (this.options.internal.some((e) => e.id === event.id)) {
         this.send(event);
killedBy: effects effect can emit internal events
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/actor.ts:466:45
     this.#processing = true;
     while (this.#queueIndex < this.#internalQueue.length) {
       const event = this.#internalQueue[this.#queueIndex++];
-      if (this.options.internal.some((e) => e.id === event.id)) {
+      if (this.options.internal.some((e) => false)) {
         this.send(event);
       } else if (this.#outputHandler) {
killedBy: effects effect can emit internal events
statusReason: expected 'loading' to be 'success' // Object.is equality

[Killed] ArrowFunction
src/actor.ts:466:38
     this.#processing = true;
     while (this.#queueIndex < this.#internalQueue.length) {
       const event = this.#internalQueue[this.#queueIndex++];
-      if (this.options.internal.some((e) => e.id === event.id)) {
+      if (this.options.internal.some(() => undefined)) {
         this.send(event);
       } else if (this.#outputHandler) {
killedBy: effects effect can emit internal events
statusReason: expected 'loading' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/actor.ts:468:18
       const event = this.#internalQueue[this.#queueIndex++];
       if (this.options.internal.some((e) => e.id === event.id)) {
         this.send(event);
-      } else if (this.#outputHandler) {
+      } else if (true) {
         this.#outputHandler(event);
       }
killedBy: output handler branch emitted event without outputHandler and not internal — no-op path
statusReason: this[#outputHandler] is not a function

[Survived] BlockStatement
src/actor.ts:468:39
       const event = this.#internalQueue[this.#queueIndex++];
       if (this.options.internal.some((e) => e.id === event.id)) {
         this.send(event);
-      } else if (this.#outputHandler) {
-        this.#outputHandler(event);
-      }
+      } else if (this.#outputHandler) {}
     }
     this.#internalQueue.length = 0;

[Killed] BooleanLiteral
src/actor.ts:474:24
     }
     this.#internalQueue.length = 0;
     this.#queueIndex = 0;
-    this.#processing = false;
+    this.#processing = true;
     if (this.#internalQueue.length === 0 && this.#settledResolvers.length > 0) {
       const resolvers = this.#settledResolvers.splice(0);
killedBy: settled resolves after internal queue drains
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] EqualityOperator
src/actor.ts:475:45
     this.#internalQueue.length = 0;
     this.#queueIndex = 0;
     this.#processing = false;
-    if (this.#internalQueue.length === 0 && this.#settledResolvers.length > 0) {
+    if (this.#internalQueue.length === 0 && this.#settledResolvers.length <= 0) {
       const resolvers = this.#settledResolvers.splice(0);
       for (const resolve of resolvers) {

[Survived] ConditionalExpression
src/actor.ts:475:9
     this.#internalQueue.length = 0;
     this.#queueIndex = 0;
     this.#processing = false;
-    if (this.#internalQueue.length === 0 && this.#settledResolvers.length > 0) {
+    if (true) {
       const resolvers = this.#settledResolvers.splice(0);
       for (const resolve of resolvers) {

[Survived] BlockStatement
src/actor.ts:477:40
     this.#processing = false;
     if (this.#internalQueue.length === 0 && this.#settledResolvers.length > 0) {
       const resolvers = this.#settledResolvers.splice(0);
-      for (const resolve of resolvers) {
-        resolve();
-      }
+      for (const resolve of resolvers) {}
     }
   }

[Killed] BlockStatement
src/actor.ts:483:24
     }
   }
 
-  snapshot(): Snapshot {
-    return this.#snapshot(this.state);
-  }
+  snapshot(): Snapshot {}
 
   #snapshot(s: AnyStateRef): Snapshot {
killedBy: snapshot flat state — path is [stateName], regions is empty
statusReason: expected undefined to deeply equal { path: [ 'off' ], regions: {} }

[Killed] BlockStatement
src/actor.ts:487:39
     return this.#snapshot(this.state);
   }
 
-  #snapshot(s: AnyStateRef): Snapshot {
-    const path = [s.name];
-    const regions: Record<string, Snapshot> = {};
-
-    for (const [regionName, child] of this.#regions) {
-      regions[regionName] = child.snapshot();
-    }
-
-    const snap: Snapshot = { path, regions };
-
-    if (s.isFinal) {
-      snap.done = true;
-    }
-
-    return snap;
-  }
+  #snapshot(s: AnyStateRef): Snapshot {}
 }
 
killedBy: snapshot flat state — path is [stateName], regions is empty
statusReason: expected undefined to deeply equal { path: [ 'off' ], regions: {} }

[Killed] ArrayDeclaration
src/actor.ts:488:18
   }
 
   #snapshot(s: AnyStateRef): Snapshot {
-    const path = [s.name];
+    const path = [];
     const regions: Record<string, Snapshot> = {};
 
killedBy: snapshot flat state — path is [stateName], regions is empty
statusReason: expected { path: [], regions: {} } to deeply equal { path: [ 'off' ], regions: {} }

[Killed] BlockStatement
src/actor.ts:491:54
     const path = [s.name];
     const regions: Record<string, Snapshot> = {};
 
-    for (const [regionName, child] of this.#regions) {
-      regions[regionName] = child.snapshot();
-    }
+    for (const [regionName, child] of this.#regions) {}
 
     const snap: Snapshot = { path, regions };
killedBy: snapshot hierarchical — single region
statusReason: expected { path: [ 'connected' ], regions: {} } to deeply equal { path: [ 'connected' ], …(1) }

[Killed] ConditionalExpression
src/actor.ts:497:9
 
     const snap: Snapshot = { path, regions };
 
-    if (s.isFinal) {
+    if (true) {
       snap.done = true;
     }
killedBy: snapshot flat state — path is [stateName], regions is empty
statusReason: expected { path: [ 'off' ], regions: {}, …(1) } to deeply equal { path: [ 'off' ], regions: {} }

[Survived] BlockStatement
src/actor.ts:497:20
 
     const snap: Snapshot = { path, regions };
 
-    if (s.isFinal) {
-      snap.done = true;
-    }
+    if (s.isFinal) {}
 
     return snap;

[Survived] BooleanLiteral
src/actor.ts:498:19
     const snap: Snapshot = { path, regions };
 
     if (s.isFinal) {
-      snap.done = true;
+      snap.done = false;
     }
 

[Killed] BlockStatement
src/actor.ts:528:90
 
 function resolveInitial<S>(
   initial: InitialState<S>,
-): S extends StateRef<infer N, infer P> ? { state: StateRef<N, P>; payload?: P } : never {
-  if (initial instanceof TransitionStateClass) {
-    return { state: initial.__stateRef, payload: initial.__payload } as ReturnType<
-      typeof resolveInitial<S>
-    >;
-  }
-  const result =
-    typeof initial === "object" && initial !== null && "state" in initial
-      ? initial
-      : { state: initial };
-  return result as ReturnType<typeof resolveInitial<S>>;
-}
+): S extends StateRef<infer N, infer P> ? { state: StateRef<N, P>; payload?: P } : never {}
 
killedBy: snapshot flat state — path is [stateName], regions is empty
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] ConditionalExpression
src/actor.ts:529:7
 function resolveInitial<S>(
   initial: InitialState<S>,
 ): S extends StateRef<infer N, infer P> ? { state: StateRef<N, P>; payload?: P } : never {
-  if (initial instanceof TransitionStateClass) {
+  if (true) {
     return { state: initial.__stateRef, payload: initial.__payload } as ReturnType<
       typeof resolveInitial<S>
killedBy: timers timer fires after advance
statusReason: Cannot read properties of undefined (reading 'name')

[Survived] ConditionalExpression
src/actor.ts:529:7
 function resolveInitial<S>(
   initial: InitialState<S>,
 ): S extends StateRef<infer N, infer P> ? { state: StateRef<N, P>; payload?: P } : never {
-  if (initial instanceof TransitionStateClass) {
+  if (false) {
     return { state: initial.__stateRef, payload: initial.__payload } as ReturnType<
       typeof resolveInitial<S>

[Killed] EqualityOperator
src/actor.ts:535:36
     >;
   }
   const result =
-    typeof initial === "object" && initial !== null && "state" in initial
+    typeof initial === "object" && initial === null && "state" in initial
       ? initial
       : { state: initial };
killedBy: TransitionState initial actor accepts { state, payload } object as initial
statusReason: expected undefined to be 'on' // Object.is equality

[Killed] EqualityOperator
src/actor.ts:535:5
     >;
   }
   const result =
-    typeof initial === "object" && initial !== null && "state" in initial
+    typeof initial !== "object" && initial !== null && "state" in initial
       ? initial
       : { state: initial };
killedBy: TransitionState initial actor accepts { state, payload } object as initial
statusReason: expected undefined to be 'on' // Object.is equality
