[Killed] BlockStatement
src/event.ts:1:54
-export function event<const T extends string>(id: T) {
-  return <Payload>() => {
-    return new EventRef<T, Payload>(id);
-  };
-}
+export function event<const T extends string>(id: T) {}
 
 export type AnyEventRef = EventRef<string>;
killedBy: snapshot flat state — path is [stateName], regions is empty
statusReason: event(...) is not a function

[Killed] BlockStatement
src/event.ts:2:25
 export function event<const T extends string>(id: T) {
-  return <Payload>() => {
-    return new EventRef<T, Payload>(id);
-  };
+  return <Payload>() => {};
 }
 
killedBy: timers timer fires after advance
statusReason: Cannot read properties of undefined (reading 'create')

[Killed] BlockStatement
src/event.ts:13:22
   id: T;
   payload: Payload | undefined;
 
-  constructor(id: T) {
-    this.id = id;
-  }
+  constructor(id: T) {}
 
   is(anyEvent: AnyEventRef): anyEvent is typeof this {
killedBy: snapshot flat state — after transition
statusReason: expected { path: [ 'off' ], regions: {} } to deeply equal { path: [ 'on' ], regions: {} }

[Killed] BlockStatement
src/event.ts:17:54
     this.id = id;
   }
 
-  is(anyEvent: AnyEventRef): anyEvent is typeof this {
-    return anyEvent && anyEvent.id === this.id;
-  }
+  is(anyEvent: AnyEventRef): anyEvent is typeof this {}
 
   create(payload: Payload): Payload & { id: string } {
killedBy: EventRef is — returns true when ids match
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/event.ts:18:24
   }
 
   is(anyEvent: AnyEventRef): anyEvent is typeof this {
-    return anyEvent && anyEvent.id === this.id;
+    return anyEvent && anyEvent.id !== this.id;
   }
 
killedBy: EventRef is — returns true when ids match
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/event.ts:18:12
   }
 
   is(anyEvent: AnyEventRef): anyEvent is typeof this {
-    return anyEvent && anyEvent.id === this.id;
+    return false;
   }
 
killedBy: EventRef is — returns true when ids match
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/event.ts:21:54
     return anyEvent && anyEvent.id === this.id;
   }
 
-  create(payload: Payload): Payload & { id: string } {
-    return { ...payload, id: this.id };
-  }
+  create(payload: Payload): Payload & { id: string } {}
 }
 
killedBy: effects effect can emit internal events
statusReason: Cannot read properties of undefined (reading 'id')
