[Killed] BlockStatement
src/state.ts:3:54
 export type AnyStateRef = StateRef<string, unknown>;
 
-export function state<const T extends string>(id: T) {
-  return <Payload = unknown>() => new StateRef<T, Payload>(id);
-}
+export function state<const T extends string>(id: T) {}
 
 export type StaticStateRef<T extends string> = StateRef<T, unknown>;
killedBy: snapshot flat state — path is [stateName], regions is empty
statusReason: state(...) is not a function

[Killed] ArrowFunction
src/state.ts:4:10
 export type AnyStateRef = StateRef<string, unknown>;
 
 export function state<const T extends string>(id: T) {
-  return <Payload = unknown>() => new StateRef<T, Payload>(id);
+  return () => undefined;
 }
 
killedBy: snapshot flat state — path is [stateName], regions is empty
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BooleanLiteral
src/state.ts:24:13
 export class StateRef<const T extends string, Payload = unknown> {
   name: T;
   __payload: Payload | undefined;
-  isFinal = false;
+  isFinal = true;
   _regions: RegionsOptions | undefined;
 
killedBy: snapshot flat state — path is [stateName], regions is empty
statusReason: expected { path: [ 'off' ], regions: {}, …(1) } to deeply equal { path: [ 'off' ], regions: {} }

[Killed] BlockStatement
src/state.ts:27:24
   isFinal = false;
   _regions: RegionsOptions | undefined;
 
-  constructor(name: T) {
-    this.name = name;
-  }
+  constructor(name: T) {}
 
   create<P extends Payload>(payload: P): TransitionState<T, P> {
killedBy: snapshot flat state — path is [stateName], regions is empty
statusReason: expected { path: [ undefined ], regions: {} } to deeply equal { path: [ 'off' ], regions: {} }

[Killed] BlockStatement
src/state.ts:31:64
     this.name = name;
   }
 
-  create<P extends Payload>(payload: P): TransitionState<T, P> {
-    return new TransitionState(this as unknown as StateRef<T, P>, payload);
-  }
+  create<P extends Payload>(payload: P): TransitionState<T, P> {}
 
   regions<
killedBy: snapshot flat state — after transition
statusReason: expected { path: [ 'off' ], regions: {} } to deeply equal { path: [ 'on' ], regions: {} }

[Killed] BlockStatement
src/state.ts:38:56
   regions<
     States extends Record<string, AnyStateRef> = Record<string, AnyStateRef>,
     K extends keyof States & string = string,
-  >(options: Record<string, RegionOptions<States, K>>) {
-    this._regions = options;
-    return this;
-  }
+  >(options: Record<string, RegionOptions<States, K>>) {}
 
   final() {
killedBy: regions() configures multiple regions and returns self
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/state.ts:43:11
     return this;
   }
 
-  final() {
-    this.isFinal = true;
-    return this;
-  }
+  final() {}
 }
 
killedBy: on done subscription fires when reaching final state
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/state.ts:44:20
   }
 
   final() {
-    this.isFinal = true;
+    this.isFinal = false;
     return this;
   }
killedBy: on done subscription fires when reaching final state
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/state.ts:57:65
   __payload: Payload;
   name: T;
 
-  constructor(stateRef: StateRef<T, Payload>, payload: Payload) {
-    this.__stateRef = stateRef;
-    this.__payload = payload;
-    this.name = stateRef.name;
-  }
+  constructor(stateRef: StateRef<T, Payload>, payload: Payload) {}
 }
 
killedBy: snapshot flat state — after transition
statusReason: Cannot read properties of undefined (reading 'name')
