[Killed] BlockStatement
src/index.ts:1:22
-export function fn() {
-  return "Hello, tsdown!";
-}
+export function fn() {}
 
killedBy: fn
statusReason: expected undefined to be 'Hello, tsdown!' // Object.is equality
